In [3]:
# import sklearn as sk
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

<h3>데이터 불러오기</h3>

In [35]:
df = pd.read_csv("nubija_15-16.csv", sep=',', encoding='EUC-KR')

In [7]:
chr(0xc0) # utf-8 인코딩은 오류남.

'À'

In [36]:
df.head()

   Unnamed: 0  자전거번호  출발터미널       출발일  출발시간  도착터미널       도착일   도착시간
0           1   5322    180  20150101     0    180  20150101     19
1           2   6844     94  20150101    10    144  20150101   1435
2           3   5475    180  20150101    35    107  20150101    345
3           4   6347     28  20150101    36    121  20150101  91100
4           5   7416      9  20150101    41     60  20150101   1109

In [43]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11718608 entries, 0 to 11718607
Data columns (total 7 columns):
id               object
dept_terminal    object
dept_date        int64
dept_time        int64
arr_terminal     object
arr_date         int64
arr_time         int64
dtypes: int64(4), object(3)
memory usage: 625.8+ MB

<h3>'unnamed: 0' (index) 컬럼 제거하고 column명 영어로 변경</h3>

In [37]:
df = df.drop('Unnamed: 0', axis=1)

In [38]:
col_eng2kor = {"자전거번호":"id", "출발터미널":"dept_terminal", "출발일":"dept_date", "출발시간":"dept_time", "도착터미널":"arr_terminal", "도착일":"arr_date", "도착시간":"arr_time" }

In [39]:
df.rename(columns=col_eng2kor, inplace=True)

<h3>todatetime하기 전에 int64인 날짜, 시간 zero fill하고 str으로 바꿈. </h3>
<h3>bike id와 terminal id도 str으로 바꿔줌.</h3>

In [41]:
print(str(91100).zfill(6))
type(str(91100).zfill(6))

091100

str

In [62]:
df.head()

     id dept_terminal  dept_date  dept_time arr_terminal  arr_date  arr_time
0  5322           180   20150101          0          180  20150101        19
1  6844            94   20150101         10          144  20150101      1435
2  5475           180   20150101         35          107  20150101       345
3  6347            28   20150101         36          121  20150101     91100
4  7416             9   20150101         41           60  20150101      1109

In [42]:
df["id"] = df["id"].astype(str)
df["dept_terminal"] = df["dept_terminal"].astype(str)
df["arr_terminal"] = df["arr_terminal"].astype(str)

In [58]:
dt = df["dept_terminal"].astype(str)
dt = str(dt).zfill(6)

In [61]:
dt

'0           180\n1            94\n2           180\n3            28\n4             9\n5           148\n6            21\n7            28\n8            11\n9           222\n10          136\n11            9\n12           57\n13           96\n14           48\n15           15\n16           61\n17           61\n18           58\n19           73\n20          164\n21          115\n22           73\n23          100\n24          133\n25          151\n26           35\n27           58\n28          255\n29          110\n           ... \n11718578     99\n11718579     93\n11718580    122\n11718581    151\n11718582     71\n11718583    163\n11718584    197\n11718585    173\n11718586     80\n11718587    163\n11718588     70\n11718589    163\n11718590    200\n11718591    200\n11718592    124\n11718593    135\n11718594    284\n11718595     96\n11718596    173\n11718597     93\n11718598     40\n11718599    284\n11718600     42\n11718601    154\n11718602     42\n11718603    125\n11718604    199\n11718605     21\n11718606     21\n11718607     22\nName: dept_terminal, Length: 11718608, dtype: object'

In [33]:
df["dept_date"] = df["dept_date"].zfill(6)
df["dept_time"] = str(df["dept_time"]).zfill(6)
df["arr_date"] = str(df["arr_date"]).zfill(6)
df["arr_time"] = str(df["arr_time"]).zfill(6)

In [34]:
df.head()

,id,dept_terminal,dept_date,dept_time,arr_terminal,arr_date,arr_time
0,0 5322\n1 6844\n2 ...,0 180\n1 94\n2 ...,0 0 20150101\n1 ...,0 0 0\n1 ...,0 180\n1 144\n2 ...,0 0 20150101\n1 ...,0 19\n1 1435\n2 ...
1,0 5322\n1 6844\n2 ...,0 180\n1 94\n2 ...,0 0 20150101\n1 ...,0 0 0\n1 ...,0 180\n1 144\n2 ...,0 0 20150101\n1 ...,0 19\n1 1435\n2 ...
2,0 5322\n1 6844\n2 ...,0 180\n1 94\n2 ...,0 0 20150101\n1 ...,0 0 0\n1 ...,0 180\n1 144\n2 ...,0 0 20150101\n1 ...,0 19\n1 1435\n2 ...
3,0 5322\n1 6844\n2 ...,0 180\n1 94\n2 ...,0 0 20150101\n1 ...,0 0 0\n1 ...,0 180\n1 144\n2 ...,0 0 20150101\n1 ...,0 19\n1 1435\n2 ...
4,0 5322\n1 6844\n2 ...,0 180\n1 94\n2 ...,0 0 20150101\n1 ...,0 0 0\n1 ...,0 180\n1 144\n2 ...,0 0 20150101\n1 ...,0 19\n1 1435\n2 ...

In [63]:
test = df["dept_time"].copy(deep=True)

In [64]:
test.astype(str).values.zfill(6)

AttributeError: 'numpy.ndarray' object has no attribute 'zfill'

In [ ]:
test